01 WS-SUM PIC 9(3) OCCURS 100 TIMES VALUE ZERO. 
01 WS-COUNTER PIC 9(3). 
01 WS-SUM-TOTAL PIC 9(5) VALUE ZERO. 
MOVE 0 TO WS-COUNTER. 
PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 100 
    ADD WS-COUNTER TO WS-SUM(WS-COUNTER) 
    ADD WS-SUM(WS-COUNTER) TO WS-SUM-TOTAL 
END-PERFORM. 
DISPLAY "Sum is: ", WS-SUM-TOTAL.